In [1]:
import pandas as pd
import matplotlib.pyplot as plt

Matplotlib created a temporary cache directory at /tmp/matplotlib-d1tq35vk because the default path (/home/mosaic-ai/.cache/matplotlib) is not a writable directory; it is highly recommended to set the MPLCONFIGDIR environment variable to a writable directory, in particular to speed up the import of Matplotlib and to better support multiprocessing.

In [10]:
import seaborn as sns
import subprocess

# create_temp_table warning suppresion
import warnings; warnings.simplefilter('ignore')
import configparser

In [11]:
#Import all snowflake connection details from template variables.
db_user = 'MANISH'
db_password = 'Password@2023'
db_account = 'ug94937.us-east4.gcp'
db_database =  'FDC_BANKING_FS'
db_role = 'MANISH'
db_warehouse = 'FOSFOR_SOLUTIONS_WH'
db_schema = 'PUBLIC'

In [12]:
from snowflake.snowpark.session import Session
connection_params = {
    'user': db_user,
    'password': db_password,
    'account': db_account,
    'warehouse': db_warehouse,
    'database': db_database,
    'schema': db_schema,
    'role': db_role
}
session1 = Session.builder.configs(connection_params).create()

In [13]:
session1.sql('use warehouse FOSFOR_SOLUTIONS_WH;').collect()
session1.sql('use database FDC_BANKING_FS;').collect()
session1.sql('use schema FDC_BANKING_FS.PUBLIC;').collect()

[Row(status='Statement executed successfully.')]

In [15]:
transaction = session1.table("TRANSACTION_MASTER_DATA")

In [16]:
df = transaction.to_pandas()

In [17]:
df.shape

(328860, 11)

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 328860 entries, 0 to 328859
Data columns (total 11 columns):
 #   Column                   Non-Null Count   Dtype
---  ------                   --------------   -----
 0   DATE                     328860 non-null  object
 1   WEEKDAY_FLAG             328860 non-null  object
 2   HOLIDAY_FLAG             328860 non-null  object
 3   BANK_ID                  328860 non-null  int8
 4   STATE                    328860 non-null  object
 5   BANK_NAME                328860 non-null  object
 6   ATM_ID                   328860 non-null  object
 7   DISPENSED_AMOUNT         328860 non-null  float64
 8   TOTAL_TRANSACTION_COUNT  328860 non-null  float64
 9   DOWNTIME_IN_MINS         328860 non-null  float64
 10  ATM_MAX_CAPACITY         328860 non-null  float64
dtypes: float64(4), int8(1), object(6)
memory usage: 25.4+ MB

In [19]:
df.head()

,DATE,WEEKDAY_FLAG,HOLIDAY_FLAG,BANK_ID,STATE,BANK_NAME,ATM_ID,DISPENSED_AMOUNT,TOTAL_TRANSACTION_COUNT,DOWNTIME_IN_MINS,ATM_MAX_CAPACITY
0,2023-01-29,Y,N,3,Maine,Citibank,TBH000274025,225180.0,90.0,0.0,2860000.0
1,2023-01-30,Y,N,3,Maine,Citibank,TBH000274025,262440.0,117.0,0.0,2860000.0
2,2023-01-31,Y,N,3,Maine,Citibank,TBH000274025,561150.0,160.0,0.0,2860000.0
3,2023-02-01,Y,N,3,Maine,Citibank,TBH000274025,437220.0,129.0,0.0,2860000.0
4,2023-02-02,Y,N,3,Maine,Citibank,TBH000274025,360900.0,119.0,0.0,2860000.0

In [20]:
df.columns

Index(['DATE', 'WEEKDAY_FLAG', 'HOLIDAY_FLAG', 'BANK_ID', 'STATE', 'BANK_NAME',
       'ATM_ID', 'DISPENSED_AMOUNT', 'TOTAL_TRANSACTION_COUNT',
       'DOWNTIME_IN_MINS', 'ATM_MAX_CAPACITY'],
      dtype='object')

In [22]:
column = ['WEEKDAY_FLAG', 'HOLIDAY_FLAG', 'BANK_ID', 'STATE', 'BANK_NAME','ATM_ID']
for col in column:
    print ("Column name - ", col, "---> ",df[col].value_counts())
    print ("=============================================")

Column name -  WEEKDAY_FLAG --->  WEEKDAY_FLAG
Y    234780
N     94080
Name: count, dtype: int64
=============================================
Column name -  HOLIDAY_FLAG --->  HOLIDAY_FLAG
N    315420
Y     13440
Name: count, dtype: int64
=============================================
Column name -  BANK_ID --->  BANK_ID
3    109620
1    109620
2    109620
Name: count, dtype: int64
=============================================
Column name -  STATE --->  STATE
Minnesota         10962
Kansas            10962
Nevada            10962
Tennessee         10179
Nebraska          10179
Montana           10179
Alabama            9396
Maine              8613
Hawaii             8613
Vermont            8613
Michigan           8613
Ohio               8613
Missouri           7830
Colorado           7830
Idaho              7830
Wisconsin          7830
Illinois           7830
North Dakota       7830
Utah               7830
North Carolina     7830
Oregon             7047
Florida            7047
Arizona            6264
Oklahoma           6264
Georgia            6264
South Dakota       6264
Delaware           6264
New Mexico         6264
Louisiana          6264
South Carolina     6264
Washington         5481
Arkansas           5481
New York           5481
New Hampshire      5481
California         5481
Iowa               5481
Wyoming            4698
Pennsylvania       4698
Texas              4698
Virginia           4698
Maryland           4698
Alaska             4698
Indiana            4698
Massachusetts      3915
Rhode Island       3915
Mississippi        3915
West Virginia      3132
New Jersey         2349
Connecticut        1566
Kentucky           1566
Name: count, dtype: int64
=============================================
Column name -  BANK_NAME --->  BANK_NAME
Citibank       109620
Wells Fargo    109620
BNY Mellon     109620
Name: count, dtype: int64
=============================================
Column name -  ATM_ID --->  ATM_ID
TBH000274025    783
SPCND74         783
SPCNG387        783
SPCNG386        783
SPCNG385        783
               ...
APAN11109       783
APCN835         783
APCN834         783
APCN833         783
TBH000274024    783
Name: count, Length: 420, dtype: int64
=============================================

In [23]:
df.isnull().sum()

DATE                       0
WEEKDAY_FLAG               0
HOLIDAY_FLAG               0
BANK_ID                    0
STATE                      0
BANK_NAME                  0
ATM_ID                     0
DISPENSED_AMOUNT           0
TOTAL_TRANSACTION_COUNT    0
DOWNTIME_IN_MINS           0
ATM_MAX_CAPACITY           0
dtype: int64

In [24]:
df.describe()

,BANK_ID,DISPENSED_AMOUNT,TOTAL_TRANSACTION_COUNT,DOWNTIME_IN_MINS,ATM_MAX_CAPACITY
count,328860.000000,3.288600e+05,328860.000000,328860.000000,3.288600e+05
mean,2.000000,3.217324e+05,83.735632,126.453506,3.300000e+06
std,0.816498,2.818005e+05,71.546692,305.196984,3.840641e+05
min,1.000000,0.000000e+00,0.000000,0.000000,2.420000e+06
25%,1.000000,7.227000e+04,22.000000,0.000000,2.860000e+06
50%,2.000000,2.866500e+05,78.000000,0.000000,3.520000e+06
75%,3.000000,4.904100e+05,124.000000,37.000000,3.520000e+06
max,3.000000,1.936620e+06,504.000000,1296.000000,3.740000e+06